controllers/SiteController.php

SELECT * FROM `family`
SELECT * FROM `weight`
SELECT * FROM `style`
SELECT * FROM `size`
---
    public function actionIndex()
    {

        $families = Family::find()->asArray()->all();
        $weights = Weight::find()->asArray()->all();
        $styles = Style::find()->asArray()->all();
        $sizes = Size::find()->asArray()->all();